[
  {
    "id": 1,
    "text": "Why luxury carmakers are now building glitzy skyscrapers? Bugatti is synonymous with high-performance, ultra-expensive supercars. But now the luxury French brand is entering a very different kind of race – not on the track, but in the skyline.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 2,
    "text": "Spain's commitment to renewable energy may be in doubt. On the edge of the sleepy town of Figueruelas, a single, vast wind turbine spins around, casting its shadow over the buildings nearby. It's a reminder of the importance of renewable electricity in this windswept area of Aragón, in north-eastern Spain, whose plains are host to many of the country's wind and solar energy farms.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 3,
    "text": "The Swiss city that lets you pay for most things with bitcoin. In a McDonald's by a lake surrounded by mountains, in the centre of the Swiss city of Lugano, a customer orders coffee. 'Can I pay with bitcoin?' he asks, and the person behind the counter holds out what looks like a credit card payment terminal.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 4,
    "text": "Greek sheep and goat cull raises fears of feta cheese shortage. Hundreds of thousands of sheep and goats are being culled in Greece, due to the outbreak of an infectious disease. It may affect production and exports of the country's famous feta cheese. Anastasia Siourtou walks through her deserted farm on the outskirts of Karditsa, a city in the Thessaly region of central Greece. An eerie silence hangs over the place where 650 sheep were being raised.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 5,
    "text": "Fracking has transformed an Argentine town but what about the nation? Mechanic Fabio Javier Jiménez found himself in the right place at the right time. When his father moved their family-owned tyre repair shop to the rural Argentine town of Añelo, it was a small, sleepy place, some 1,000km (600 miles) southwest of Buenos Aires. There was no mains water or gas, and the electricity supply was constantly being cut off.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 6,
    "text": "How my on-air 'brain fog' moment sparked a big debate? When I rather nervously shared a personal post about dealing with brain fog at work on the social network LinkedIn last week, I had no idea that it would have such an enormous impact. It's been viewed hundreds of thousands of times. Women have stopped me on the street to talk to me about it. I've been overwhelmed by hundreds of messages from people sharing support and their own experiences of it.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 7,
    "text": "From florist to drone maker: How the weapon became so mainstream? The ongoing conflict in Ukraine is often described as the world's 'first drone war'. It has led to a continuing huge growth in the production of military drones, both within and outside Ukraine. Before Russia's invasion of Ukraine Kseniia Kalmus was a floral artist. She co-owned a flower shop in Kyiv and travelled around Europe showcasing her floral arrangements. Now, she makes drones for use against the Russians.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 8,
    "text": "The indigenous weavers who aim for empowerment over exploitation. For every handwoven bag she sells on the palm-lined promenade of Riohacha, a city on Colombia's Caribbean coast, Sandra Aguilar feels that she's sharing a piece of her heritage. Once used exclusively by the Wayuu, the largest indigenous group in the South American country, the bags - known as mochilas - are now a staple across Colombia, and popular with foreign tourists.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 9,
    "text": "Cuba's tourism minister insists sector 'alive and kicking' amid crisis. When US President Barack Obama stepped off Air Force One onto Cuban soil in 2016, he was one of around four million visitors to the island that year. A record high at the time, Cuba's visitor numbers continued to grow until a high-water mark of almost five million people two years later. Since then, however, the fall in Cuban tourism has been precipitous.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 10,
    "text": "The Gulf bets big on AI as it seeks the 'new oil'. When Donald Trump touched down in the United Arab Emirates (UAE) earlier this year, he arrived not just with headlines, but with deals, ambition, and AI firepower. The US president was given a royal welcome, but the real centrepiece of the visit was the announcement of a sprawling new AI campus - a joint UAE-US initiative. Billed as the largest AI infrastructure hub outside the US, it symbolised the Gulf's boldest bid yet to plant itself at the heart of the global AI map.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 11,
    "text": "Czech billionaire's CSG launches record defence IPO, aiming to raise $4.4 billion. Prague-based Czechoslovak Group (CSG) will float up to a 15.2% stake in its initial public offering, it said on Tuesday, valuing the company's shares at 25 billion euros ($29 billion) in what is set to be the biggest-ever defence sector listing.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 12,
    "text": "Volkswagen reports stronger cash flow despite Porsche woes and weak China sales.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 13,
    "text": "AI company Eightfold sued for helping companies secretly score job seekers.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 14,
    "text": "Lemonade to cut insurance rates for Tesla drivers in endorsement of EV maker's software technology.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 15,
    "text": "OpenAI to test ads in ChatGPT in bid to boost revenue",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 16,
    "text": "ECB's Panetta says banks will need to issue fully digital private money.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 17,
    "text": "Bitcoin dips below $90,000 as AI worries dent risk appetite.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 18,
    "text": "Coal India unit Bharat Coking Coal valued at $2.2 billion after stellar market debut",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 19,
    "text": "L&T Technology Services cuts revenue forecast, sees mid single-digit growth in fiscal 2026",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 20,
    "text": "UK's Petrofac seeks creditors' compromise on claims to allow asset sale",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 21,
    "text": "Indian shares snap losing streak as US envoy's remarks soothe tariff woes",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 22,
    "text": "The drastic investment slump in the second half of 2025 has raised significant cross-sector credit risks for rated issuers in China: Fitch Ratings. The property downturn has pushed several cashed-strapped developers into distress. Beijing's push to spur infrastructure construction for the digital economy may lead to a mild recovery in public investment.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 23,
    "text": "The U.S. labor market ended 2025 on a soft note, with job creation in December less than expected, according to a report Friday from the Bureau of Labor Statistics. Nonfarm payrolls rose a seasonally adjusted 50,000 for the month, lower than the downwardly revised 56,000 in November and short of the Dow Jones estimate for 73,000. At the same time, the unemployment rate fell to 4.4%, compared with the forecast for 4.5%.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 24,
    "text": "As Senate Republicans debate trillions of tax breaks advanced by the House, some business owners could be blocked from part of the proposed windfall, policy experts say. If enacted as written, the House GOP's 'One Big Beautiful Bill Act' would raise the federal deduction limit for state and local taxes, known as SALT, to $40,000. That would phase out once income exceeds $500,000. The bill would also boost a tax break for pass-through businesses, known as the qualified business income, or QBI, deduction, to 23%. But the measure would end a popular state-level SALT cap workaround for certain pass-through business owners.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 25,
    "text": "Chris Schwegmann is getting creative with how artificial intelligence is being used in law. At Dallas-based boutique law firm Lynn Pinker Hurst & Schwegmann, he sometimes asks AI to channel Supreme Court Chief Justice John Roberts or Sherlock Holmes. Schwegmann said after uploading opposing counsel's briefs, he'll ask legal technology platform Harvey to assume the role of a legal mind like Roberts to see how the chief justice would think about a particular problem.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 26,
    "text": "Just across the U.S.-Canada border, some small businesses are taking tariffs personally. President Donald Trump has said his wide-sweeping tariffs, even on some of the country's closest trade partners, will rebalance international trade and bring manufacturing back stateside. But for the U.S.'s northern neighbors, tariffs may mean an erosion of trust.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 27,
    "text": "Amazon may be the epitome of big business, but more than 60% of the behemoth's sales last year came from small- and medium-sized businesses. Small businesses rely on Amazon for its reach and breadth, while Amazon needs independent sellers to fill its site with products. But the relationship can be uneasy. Sellers have complained about rising costs to sell on the site. The Federal Trade Commission antitrust lawsuit against Amazon, meanwhile, accusing the e-commerce giant of wielding its 'monopoly power' to raise prices, stifle competition and leave shoppers with worse service. The lawsuit also accuses Amazon of forcing sellers to pay expensive fulfillment and advertising fees, with little choice but to rely on the e-commerce giant to stay in business.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 28,
    "text": "The founder of a new business said while jobs may look different in the future, there is 'no reason why Guernsey would lose net jobs' to artificial intelligence (AI). The CEO of Bank Aston, Paul Gorman, has about 10 employees pre-launch and plans to use AI as part of the bank's workflow. 'You may lose existing jobs, but those statistics don't take account of the new jobs that are being created because of the advent of new technologies,' he said. In 2020, work by PricewaterhouseCoopers (PwC) in the Channel Islands estimated that about 10,800 jobs in Guernsey were at risk due to automation between then and 2035.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 29,
    "text": "Adverts will soon appear at the top of the AI tool ChatGPT for some users, the company OpenAI has announced. The trial will initially take place in the US, and will affect some ChatGPT users on the free service and a new subscription tier, called ChatGPT Go. This cheaper option will be available for all users worldwide, and will cost $8 a month, or the equivalent pricing in other currencies.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 30,
    "text": "In the 1990s some computer games had a 'boss key' that allowed staff to call up an Excel spreadsheet if they needed to look like they were working. Now bosses might frown upon a worker caught labouring over a spreadsheet. Excel, owned by Microsoft, is 40-years-old. Among some tech leaders it's seen as, at best, a blocker to smoother digital workflows and AI, at worst, an accident waiting to happen. Excel is certainly ubiquitous in the business world. According to research by Acuity Training, two-thirds of office workers use Excel at least once every hour.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 31,
    "text": "At the beginning of 2023, Microsoft found itself in a PR firestorm. The company was working to demonstrate its progress in artificial intelligence following a multi-billion dollar investment in OpenAI, the maker of ChatGPT. It added an AI powered chatbot into its Bing search engine, which placed it among the first legacy tech companies to fold AI into its flagship products, but almost as soon as people started using it, things went sideways.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 32,
    "text": "The final test was a blunt one. Maarten Logtenberg wielded a sledgehammer, which simply bounced off the sample, barely leaving a scratch. After two years of experimentation, the material was finally right: a particular mix of thermoplastics and fibreglass that is strong, has no need of extra coating to protect it from sunlight, and is resistant to fouling and marine growth. The perfect base, says Mr Logtenberg, from which to 3D print a boat. Boats need to withstand the unforgiving nature of the marine environment. It's one of the reasons why boatbuilding is a notoriously labour-intensive business.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 33,
    "text": "Egypt's Saving System says its technology can result in big savings on corporate electrical bills. At the heart of its product are special capacitors - devices which store electrical energy. Saving System says that, when wired up, the capacitors can make electricity use more efficient, saving the customer's money and carbon emissions. With decades of work behind the tech, Saving System's chief executive Ahmed Alwakil says that launching new tech products requires 'patience'. This is the fourth of a five-part series on technology in Africa.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 34,
    "text": "When Darby Hutchby was studying visual communication at university in 2017, artificial intelligence (AI) was a concept she was only beginning to hear about in its infancy. Eight years later, employers are able to turn to AI instead of hiring staff, and graphic design graduates like her said they felt they were 'competing' against the technology to get a job. Major companies are already starting to use the technology in their marketing campaigns, which is narrowing the number of vacancies and increasing clients' expectations for faster work results.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 35,
    "text": "UK inflation rises for first time in five months - but one-off factors blamed",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 36,
    "text": "Goldman Sachs tops profit estimates as equities, asset and wealth management outperform.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 37,
    "text": "Saks Global, the longtime leader of luxury department stores, files for bankruptcy protection. Saks Global, the parent company behind the 159-year-old department store that's become both a destination and a symbol for luxury fashion, filed for Chapter 11 bankruptcy protection on Wednesday after an unsustainable debt pile crushed its business.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 38,
    "text": "Delta CEO sees record earnings in reach again thanks to high-end travel demand. Earnings could jump more than 20% this year from 2025 thanks to robust travel demand, particularly at the high end of the market, and potentially reach a record, CEO Ed Bastian said.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 39,
    "text": "Trump's credit card rate cap plan has unclear path, 'devastating' risks, bank insiders say. Bank executives were sent scrambling over the weekend after President Donald Trump declared late Friday that American credit card companies would be subject to a 10% cap on the interest rate they can charge customers.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 40,
    "text": "BNY raises profit target as CEO Robin Vince says 'turnaround' is taking hold.",
    "labels": [
      "business"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 41,
    "text": "Global tech giants are investing billions in artificial intelligence infrastructure as the race for AI supremacy intensifies. Major companies including Microsoft, Google, and Amazon have announced significant capital expenditure plans for 2025, focusing on data centers and AI chip development. Industry analysts predict this investment wave will reshape the technology landscape over the next decade.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-ai-investment-2025",
    "date_collected": "2024-07-07",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 42,
    "text": "European Central Bank raises interest rates by 0.25% in response to persistent inflation concerns across the eurozone. The decision marks the bank's continued effort to bring inflation back to its 2% target. Economists warn that higher borrowing costs could slow economic growth in several member states, particularly those with high debt levels.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/markets/europe/ecb-rate-decision-2025",
    "date_collected": "2025-01-01",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 43,
    "text": "Tesla announces plans to build a new gigafactory in Southeast Asia, marking the company's expansion into emerging markets. The facility, expected to cost $5 billion, will produce electric vehicles specifically designed for Asian consumers. Local governments are competing to host the factory, offering substantial tax incentives and infrastructure support.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-tesla-asia-expansion",
    "date_collected": "2024-04-29",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 44,
    "text": "Major oil companies report record profits despite global push for renewable energy transition. Shell, BP, and ExxonMobil collectively earned over $100 billion in 2024, driven by sustained high energy prices. Environmental groups criticize the profits while shareholders celebrate strong returns on investment.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/energy/oil-profits-2024",
    "date_collected": "2024-04-29",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 45,
    "text": "Amazon workers in multiple countries stage coordinated strikes demanding better wages and working conditions. The labor action affects warehouses across the United States, United Kingdom, and Germany during the crucial holiday shopping season. Union representatives say the strikes could expand if negotiations with management fail to produce results.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-amazon-strikes-2024",
    "date_collected": "2024-03-21",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 46,
    "text": "China's economy grows at 5.2% in 2024, exceeding government targets despite ongoing trade tensions and property sector challenges. The growth was driven by strong manufacturing exports and government stimulus measures. However, analysts express concern about the sustainability of this growth amid demographic headwinds and geopolitical uncertainties.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/world/china/gdp-growth-2024",
    "date_collected": "2024-05-13",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 47,
    "text": "Cryptocurrency markets experience significant volatility as regulatory frameworks tighten globally. Bitcoin and Ethereum prices fluctuate wildly following announcements from the US Securities and Exchange Commission regarding new compliance requirements. Industry leaders call for clearer regulations while maintaining that blockchain technology remains transformative.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-crypto-regulation-2025",
    "date_collected": "2024-11-10",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 48,
    "text": "Global supply chain disruptions ease as shipping costs normalize and port congestion clears. Container shipping rates have fallen by 60% from their pandemic peaks, providing relief to manufacturers and retailers. Logistics experts attribute the improvement to increased vessel capacity and more efficient port operations worldwide.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/supply-chain-recovery-2024",
    "date_collected": "2024-02-29",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 49,
    "text": "Major banks announce massive job cuts as automation and artificial intelligence reshape the financial services industry. JPMorgan Chase, HSBC, and Deutsche Bank plan to eliminate thousands of positions over the next two years. The banks emphasize that AI will handle routine tasks while human employees focus on complex client relationships.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-banking-ai-jobs-2025",
    "date_collected": "2024-04-02",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 50,
    "text": "Renewable energy investments surpass fossil fuel funding for the first time in history. Global clean energy projects attracted $1.7 trillion in 2024, compared to $1.1 trillion for oil, gas, and coal. The shift reflects growing investor confidence in the energy transition and supportive government policies worldwide.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/energy/renewable-investment-milestone",
    "date_collected": "2025-01-19",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 51,
    "text": "Luxury goods market shows resilience despite economic uncertainty, with brands like Louis Vuitton and Hermès reporting strong sales growth. The sector benefits from wealthy consumers' continued spending and expansion in Asian markets. Industry analysts predict sustained demand for high-end products even as middle-market retailers struggle.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-luxury-market-2024",
    "date_collected": "2024-03-11",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 52,
    "text": "Food prices surge globally as extreme weather events disrupt agricultural production across multiple continents. Wheat, rice, and corn prices have increased by 25-40% compared to last year. The United Nations warns that rising food costs could push millions more people into food insecurity, particularly in developing nations.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/markets/commodities/food-price-crisis-2024",
    "date_collected": "2025-01-23",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 53,
    "text": "Pharmaceutical giant Pfizer announces breakthrough in cancer treatment, sending its stock price soaring. The new therapy shows promising results in clinical trials for multiple cancer types. Regulatory approval is expected within 18 months, potentially creating a multi-billion dollar revenue stream for the company.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-pfizer-cancer-breakthrough",
    "date_collected": "2024-06-26",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 54,
    "text": "Commercial real estate markets face continued pressure as remote work trends persist post-pandemic. Office vacancy rates in major cities reach record highs, forcing property owners to convert buildings into residential units. The transformation is reshaping urban landscapes and challenging traditional real estate investment models.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/real-estate-transformation-2025",
    "date_collected": "2024-10-27",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 55,
    "text": "Electric vehicle sales exceed 15 million units globally in 2024, representing 18% of total car sales. China leads the market with 60% of global EV purchases, while European and North American adoption accelerates. Traditional automakers scramble to expand their electric offerings to compete with Tesla and Chinese manufacturers.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-ev-sales-milestone-2024",
    "date_collected": "2024-10-24",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 56,
    "text": "Semiconductor shortage finally eases as new fabrication plants come online worldwide. Intel, TSMC, and Samsung have invested over $300 billion in expanding chip production capacity. The increased supply helps automotive and consumer electronics manufacturers recover from years of component shortages.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/technology/chip-shortage-ends-2024",
    "date_collected": "2024-11-09",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 57,
    "text": "Streaming services face subscriber growth challenges as market saturation sets in. Netflix, Disney+, and other platforms report slowing user acquisition and increased churn rates. Companies are exploring advertising-supported tiers and cracking down on password sharing to boost revenue amid intensifying competition.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-streaming-slowdown-2025",
    "date_collected": "2024-06-02",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 58,
    "text": "Global tourism industry rebounds strongly with international arrivals surpassing pre-pandemic levels. Airlines and hotels report record bookings as pent-up travel demand continues. However, overtourism concerns prompt some destinations to implement visitor caps and sustainability measures.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/travel/tourism-recovery-2024",
    "date_collected": "2024-07-13",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 59,
    "text": "Artificial intelligence startups attract record venture capital funding despite broader tech sector slowdown. Companies developing generative AI tools and enterprise AI solutions raise billions in new financing rounds. Investors bet that AI will drive the next wave of technological innovation and economic growth.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-ai-startup-funding-2024",
    "date_collected": "2024-09-28",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 60,
    "text": "Coffee prices hit decade highs as climate change impacts major growing regions in Brazil and Vietnam. Extreme weather patterns reduce crop yields, creating supply concerns for the world's most popular beverage. Major coffee chains consider price increases to offset rising commodity costs.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/markets/commodities/coffee-price-surge-2025",
    "date_collected": "2024-11-18",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 61,
    "text": "Retail apocalypse continues as major department store chains file for bankruptcy protection. Changing consumer preferences and e-commerce competition force traditional retailers to close hundreds of locations. The closures accelerate the transformation of shopping malls into mixed-use developments.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-retail-bankruptcies-2024",
    "date_collected": "2024-09-20",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 62,
    "text": "Hydrogen economy gains momentum as governments and corporations invest in clean fuel infrastructure. Major energy companies announce plans for hydrogen production facilities and distribution networks. Proponents argue hydrogen will be crucial for decarbonizing heavy industry and long-distance transportation.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/energy/hydrogen-investment-wave",
    "date_collected": "2024-07-19",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 63,
    "text": "Cybersecurity spending reaches new heights as companies respond to escalating digital threats. Global cybersecurity market is projected to exceed $300 billion annually by 2026. High-profile data breaches and ransomware attacks drive organizations to prioritize security investments and hire specialized personnel.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-cybersecurity-spending-2025",
    "date_collected": "2024-04-15",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 64,
    "text": "Fast fashion industry faces mounting pressure over environmental and labor practices. Major brands commit to sustainability initiatives and supply chain transparency following consumer activism and regulatory scrutiny. Critics question whether these commitments represent genuine change or merely greenwashing.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/retail/fast-fashion-sustainability",
    "date_collected": "2024-01-11",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 65,
    "text": "Space economy expands rapidly as private companies launch commercial satellites and space tourism ventures. SpaceX, Blue Origin, and other firms compete for government contracts and private customers. The growing industry creates thousands of jobs and drives innovation in aerospace technology.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-space-economy-2024",
    "date_collected": "2024-03-25",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 66,
    "text": "Central banks worldwide explore digital currency initiatives as cash usage declines. China leads with its digital yuan rollout, while the Federal Reserve and European Central Bank conduct pilot programs. Experts debate the implications for monetary policy, privacy, and financial system stability.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/technology/digital-currency-developments",
    "date_collected": "2024-04-29",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 67,
    "text": "Gig economy workers win landmark legal victories securing employee benefits and protections. Courts in multiple jurisdictions rule that platform companies must classify workers as employees rather than independent contractors. The decisions could fundamentally reshape business models for Uber, DoorDash, and similar companies.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-gig-economy-ruling-2025",
    "date_collected": "2024-10-03",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 68,
    "text": "Biotechnology sector experiences investment boom as gene therapy and personalized medicine advance. Companies developing CRISPR-based treatments and mRNA vaccines attract billions in funding. Regulatory agencies work to establish frameworks for approving these novel therapeutic approaches.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/biotech-investment-surge",
    "date_collected": "2024-04-16",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 69,
    "text": "Global shipping industry commits to zero emissions by 2050, announcing massive fleet modernization plans. Major shipping lines will invest in alternative fuels including ammonia, hydrogen, and methanol. The transition represents one of the largest industrial transformations in history, with costs estimated in the hundreds of billions.",
    "labels": [
      "business"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/business-shipping-emissions-pledge",
    "date_collected": "2025-01-03",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 70,
    "text": "Quantum computing achieves significant milestone as IBM and Google demonstrate practical applications. The breakthrough could revolutionize drug discovery, financial modeling, and cryptography. Tech giants race to develop commercially viable quantum systems while addressing technical challenges around error correction and scalability.",
    "labels": [
      "business"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/technology/quantum-computing-breakthrough",
    "date_collected": "2024-07-06",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 71,
    "text": "Taylor Swift makes history as she joins Songwriters Hall of Fame. Taylor Swift has become the youngest female artist inducted into the Songwriters Hall of Fame. It follows a glittering few years for the 36-year-old pop superstar, who broke her own sales record with her latest album, The Life of a Showgirl, in October.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 72,
    "text": "Harry says Mail publisher made his wife Meghan's 'life a misery'. The Duke of Sussex was visibly emotional as he told a court the life of his wife, the Duchess of Sussex, had been made 'an absolute misery' by the publisher of the Daily Mail and the Mail on Sunday. Prince Harry was speaking as he concluded his evidence in his case against Associated Newspapers Limited (ANL) at the High Court, much of which focused on articles about his relationships before meeting Meghan.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 73,
    "text": "Olivia Dean and Lola Young dominate Brit Award nominations. Both are on the shortlist for artist of the year, alongside former Brit-winners such as Lily Allen, Dave and Little Simz. Sam Fender follows his Mercury Prize win with four nominations, including album of the year and best single for his duet with Dean, Rein Me In.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 74,
    "text": "Wuthering Heights to The Odyssey: 16 of the most exciting films coming up in 2026. From Emerald Fennell's divisive new adaptation of Emily Brontë's Wuthering Heights to Christopher Nolan's wildly anticipated ancient Greek epic, here are BBC critics' picks of the films to see in the year ahead.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 75,
    "text": "There were a lot of threads working against this happening': How Stevie Wonder's joyful hit song changed the US. On 15 January 1981, music legends Diana Ross and Gladys Knight, along with the 'godfather of rap', Gil Scott-Heron, joined renowned musician Stevie Wonder on stage at the National Mall in Washington, DC. The 50,000-strong audience chanted: 'Martin Luther King Day, we took a holiday,' according to Scott-Heron's 2012 memoir, The Last Holiday, as the stars began to sing Wonder's hit song, Happy Birthday, a tribute to the murdered civil rights leader.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 76,
    "text": "'It's always been bleak - but it's got even darker': How Industry became the most nightmarish show on TV. Back in 2020, a new drama about a group of postgraduate bankers trying to make their way in London's high-finance scene first aired on TV. At the time, the biggest story around the joint HBO and BBC series Industry was that the first episode was directed by Girls creator Lena Dunham.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 77,
    "text": "The Pitt to A Knight of the Seven Kingdoms: 12 of the best TV shows to watch this January. From the return of HBO's award-winning medical drama to a new Game of Thrones prequel and the latest Harlan Coben mystery on Netflix.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 78,
    "text": "Beckham v Peltz Beckham: Could Brooklyn torpedo the family brand? We've tried to give our children the most normal upbringing as possible,' David said in his 2023 Netflix documentary, as Brooklyn was shown checking up on his cooking. 'But you've got a dad that was England captain and a mum that was Posh Spice.' David went on to say how proud he was, and 'so in awe of my children and the way they've turned out' - making the point that his family had withstood the pressures of fame.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 79,
    "text": "'It's why Chaplin was in a class by himself': The story behind City Lights and cinema's greatest ever final shot. Ninety-five years after its release, Charlie Chaplin's silent comedy, City Lights, is often cited as one of the greatest films ever made – and its final moments are key to its reputation. When Charlie Chaplin was asked by Life Magazine in 1966 which of his films he regarded as his favourite, he gave the honour to City Lights, before downplaying his achievements with, 'I think it's solid, well done.'",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 80,
    "text": "Jason Statham: I've taken a lot of stunts too far. He has built a career on high-speed chases, bruising fight scenes and gravity-defying stunts, but Jason Statham says that even after decades in action cinema, he is still determined to push himself 'a little bit further than the last time'. Speaking to BBC News at the premiere of his latest film Shelter, Statham admitted that his commitment to doing his own stunts has sometimes comes at a cost.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 81,
    "text": "Chris Pratt on new film Mercy: I asked to be locked into an executioner's chair. Being locked barefoot in an executioner's chair sounds uncomfortable, but that is what Chris Pratt requested for his latest film, Mercy. More familiar as a wisecracking action hero in blockbusters like Guardians of the Galaxy and Jurassic World, this role is quite a departure for him.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 82,
    "text": "How first year of music city 'energised' its scene. Being part of an international music network has energised a city's music scene with demand for live gigs increasing, independent venues have said. In January last year, Sunderland became only the second city in the UK to join the Music Cities Network.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 83,
    "text": "Jacob Alon crowned Brits Critics' Choice winner. Scottish singer-songwriter Jacob Alon has been named as the winner of the Brits Critics' Choice Award. The Fife-born musician saw off competition from soul singer Sienna Spiro and east London artist Rose Gray, known for her infectious dance-pop, to claim the title.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 84,
    "text": "From London Tube driver to Will Smith's double. Walking along a remote beach in Papua New Guinea, Shad Ellis found himself having a heart-to-heart with Will Smith, one of the most recognisable faces on the planet. The twist? The face the London Tube driver's gaze alighted on looked uncannily like his own. The 47-year-old has made a career out of being a Will Smith lookalike and tribute artist since he was 18.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 85,
    "text": "How Stevie Wonder's hit song helped create a new US holiday?",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 86,
    "text": "Top artists coming to Birmingham in 2026. There are some big names coming to Birmingham to perform. Across the city centre's venues, the likes of Florence and the Machine, Raye and the Smyths are just some of the musicians taking the the stage, as well as Alex Warren whose song Ordinary was one of the UK's biggest songs of 2025.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 87,
    "text": "The mysterious singer with millions of streams - but who (or what) is she?",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 88,
    "text": "Was A$AP Rocky's comeback album worth the eight-year wait?",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 89,
    "text": "Weekly quiz: Where are BTS kicking off their comeback tour?",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 90,
    "text": "Joy Awards 2026 Turns Riyadh Into a Global Live Music Hub With Katy Perry, Robbie Williams and Liz Mitchell of Boney M.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 91,
    "text": "Thalia to Cohost Premio Lo Nuestro 2026: 'It's a Celebration of Our Music, Our Roots'.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 92,
    "text": "Travis Scott Responds to Pusha T Diss: 'If You Got to Drop Trav Name for the Rollout, So Be It'",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 93,
    "text": "Kate Middleton & Prince William Brace as 'Seismic Revelations' About Their Relationship Come To Light",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 94,
    "text": "'We want newness, we want transformation': US fashion star Christopher John Rogers on fighting against 'quiet luxury'. The new star of US fashion Christopher John Rogers' bold designs are worn by the likes of Zendaya and Gigi Hadid. Backstage at his New York Fashion Week show, he talks style, hierarchies – and clothes as a 'tool for hope'. Connecting the dots between New York fashion's past and future might start with some actual dots. They are the size of a bottle bottom and the colour of Skittles sweets – orange, lime, cherry, grape – and hug the edges of jackets, dresses and corsets. Anne Hathaway has worn the dots.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 95,
    "text": "I feel violated by copies of my jewellery online. A jewellery designer says she feels 'violated' after a fashion website listed a 'copied' pair of her earrings for sale, with her own photos used to promote them. Emma Farley, 49, from Burnby, East Yorkshire, said she felt 'disbelief' when she saw the jewellery being advertised on X-ZIPO, which is based in Hong Kong, for less than half the price of her originals.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 96,
    "text": "Style trends to look out for in 2026: Bold colours, tassels and loud luxury. If your New Year's resolution is to stop wearing the same three outfits on rotation (don't worry I'm not judging) then you've come to the right place. Thanks to the way the fashion calendar works, we already know what the brightest minds in the industry think we will be wearing when the weather becomes a little warmer.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 97,
    "text": "Five of Queen Elizabeth II's most iconic outfits - from new royal exhibit. She was arguably the most famous woman of her time, and Queen Elizabeth II's style - though restrained and often conservative - was instantly recognisable. Just as she remained a constant presence during her 70 years on the throne, so did the show-stopping hats and bright coats of her public appearances, and the tweeds, tartans and headscarves of her off-duty look.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 98,
    "text": "TikTok seller uses grant to open first shop. A mum of three who previously sold goods via social media has opened her first permanent shop after receiving a council grant. Karissa Hughes from Madeley, Telford, started the Bouji Store in 2017, using TikTok to help grow the business.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 99,
    "text": "Prada to launch $930 'Made in India' Kolhapuri sandals after backlash. Global fashion brand Prada has announced a line of limited-edition footwear inspired by Indian-made Kolhapuri sandals, months after it faced backlash for allegedly appropriating the sandal's design. The Italian luxury brand will make 2,000 pairs of sandals in India's Maharashtra and Karnataka states, under a deal with two state-backed entities, Reuters news agency reports.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 100,
    "text": "Traitors stars, Sienna Miller's baby bump and more pictures from the Fashion Awards. Designers, models and celebrities, including West End Girl singer Lily Allen, Traitors star Cat Burns and fashion royalty Anna Wintour, descended on the Royal Albert Hall for the annual Fashion Awards on Monday night.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 101,
    "text": "From egg cartons to old tights - these students turned junk into fashion. Egg boxes, bin bags, rope, and newspaper clippings are usually thrown in the bin and forgotten about, but some students have taken those materials and created some serious fashion. Junk Kouture has arrived in Belfast and students from across Northern Ireland have had the opportunity to take waste materials and turn it into fashion.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 102,
    "text": "Halloween 2025: All the celebrity costumes at Heidi Klum's party. It is officially the scariest night of the year and, while everyone in Hollywood and beyond has been showing off their elaborate costumes, there is one party we're all watching. Heidi Klum has cemented her place as the official Queen of spooky season thanks to her wild, weird and wonderful costumes and her annual bash that attracts celebrities across the globe.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 103,
    "text": "The 'silver' fashion influencer going viral on TikTok. 'I just want to be a fashionista.' Vivienne Truran, 81, has been embracing life as an online fashion content creator. With almost 300,000 followers on Instagram, Viv, who was born and raised in Cardiff, shares daily videos of her outfits and styling tips.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 104,
    "text": "Galeries Lafayette to open its first store in India amid luxury boom. Iconic French luxury department store Galeries Lafayette is set to open its first flagship outlet in India, becoming the latest global brand to tap into the country's booming luxury market. The store, located in financial hub Mumbai, will open early November with plans for another one in capital Delhi.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 105,
    "text": "Film and fashion stars celebrate cinematic style at Vogue World. Los Angeles played host to a spectacle of style and storytelling as Vogue World: Hollywood unfolded — an immersive celebration of cinema, couture and celebrity. Blending the grandeur of classic Hollywood with the innovation of contemporary fashion, the event transformed the city into a living film set, with designers, actors and artists sharing the spotlight.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 106,
    "text": "Meghan makes surprise appearance at Paris Fashion Week. The Duchess of Sussex appeared at Paris Fashion Week to support a fashion designer friend on Saturday. Meghan attended the Balenciaga show after making the solo trip across the Atlantic.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 107,
    "text": "Photographer 'over the Moon' with iconic ET recreation two years in the making. A photographer is 'over the Moon' after recreating an iconic scene from the movie ET in a photo that has been almost two years in the making.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 108,
    "text": "Zootropolis 2 becomes Hollywood's biggest animated film ever. The film, known as Zootopia 2 in some countries, has overtaken previous record holder Inside Out 2, which made $1.69bn after its release in 2024. Zootropolis 2 is now the ninth most successful film in global box office history, behind films such as Avatar, Titanic, Avengers: Endgame and Star Wars: The Force Awakens.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 109,
    "text": "Why A Minecraft Movie was 2025's most important film? The blockbuster based on the brick-building video game came top at the US box office – and, with their 'chicken-jockey' chaos, its colourful screenings pointed to the future of cinema.",
    "labels": [
      "entertainment"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 110,
    "text": "Streaming giant Netflix announces record-breaking viewership for its latest original series, surpassing 200 million hours watched in the first week. The show's success demonstrates the platform's continued dominance in original content production. Industry analysts credit the series' diverse cast and compelling storytelling for its widespread appeal across global markets.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-netflix-record-2025",
    "date_collected": "2024-08-21",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 111,
    "text": "Taylor Swift's latest world tour becomes the highest-grossing concert series in history, generating over $2 billion in ticket sales. The tour spans five continents and includes 150 shows across 18 months. Economic studies show significant impacts on local economies, with hotels and restaurants reporting substantial revenue increases in tour cities.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/swift-tour-record-2024",
    "date_collected": "2024-02-12",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 112,
    "text": "Academy Awards ceremony introduces new category for best casting, recognizing the crucial role casting directors play in filmmaking. The decision follows years of lobbying from industry professionals. The first awards in this category will be presented at next year's ceremony, honoring work from the current film year.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-oscars-casting-category",
    "date_collected": "2024-06-29",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 113,
    "text": "Video game industry revenues surpass $200 billion globally as mobile gaming continues explosive growth. Popular titles generate billions in microtransaction revenue while cloud gaming services expand their subscriber bases. Traditional console manufacturers adapt strategies to compete in the evolving digital entertainment landscape.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/technology/gaming-revenue-milestone-2024",
    "date_collected": "2024-03-14",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 114,
    "text": "Broadway theaters report strongest season in decades with attendance and revenue exceeding pre-pandemic levels. Hit musicals and star-studded revivals draw audiences back to New York's theater district. Producers credit pent-up demand and innovative marketing strategies for the remarkable recovery.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-broadway-comeback-2024",
    "date_collected": "2024-01-14",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 115,
    "text": "K-pop phenomenon BTS announces reunion tour after members complete mandatory military service. Pre-sale tickets crash multiple websites as millions of fans attempt to secure seats. The group's return is expected to generate hundreds of millions in revenue and boost South Korea's cultural export industry.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/bts-reunion-announcement",
    "date_collected": "2024-07-02",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 116,
    "text": "Major film studios embrace artificial intelligence for visual effects and pre-production planning. Directors and cinematographers use AI tools to visualize scenes before filming begins. However, creative guilds express concerns about job displacement and the technology's impact on artistic authenticity.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-ai-filmmaking-2025",
    "date_collected": "2024-06-29",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 117,
    "text": "Music streaming platforms face artist backlash over royalty payment structures. Major musicians threaten to remove their catalogs unless compensation models change. The dispute highlights ongoing tensions between streaming services, record labels, and artists over revenue distribution in the digital music economy.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/media/streaming-royalty-dispute-2024",
    "date_collected": "2024-04-22",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 118,
    "text": "Virtual reality concerts attract millions of participants as technology improves and becomes more accessible. Artists perform in digital venues while fans attend from home using VR headsets. The format offers new revenue streams and expands audience reach beyond physical venue limitations.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-vr-concerts-2024",
    "date_collected": "2024-01-12",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 119,
    "text": "Documentary filmmaking experiences renaissance as streaming platforms invest heavily in non-fiction content. Award-winning documentaries tackle climate change, social justice, and political issues. Critics praise the medium's ability to inform and inspire action on pressing global challenges.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/documentary-boom-2025",
    "date_collected": "2024-10-30",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 120,
    "text": "Fashion industry collaborates with entertainment sector on virtual clothing for digital avatars and metaverse platforms. Luxury brands launch digital-only collections selling for thousands of dollars. The trend represents a new frontier in fashion and gaming convergence.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-digital-fashion-2025",
    "date_collected": "2024-08-25",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 121,
    "text": "Independent film festivals adapt to hybrid formats combining in-person screenings with virtual access. The model increases accessibility for global audiences while maintaining the festival atmosphere. Filmmakers appreciate expanded exposure opportunities beyond traditional geographic limitations.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/film-festival-evolution",
    "date_collected": "2025-01-19",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 122,
    "text": "Podcast industry continues rapid growth with advertising revenue projected to exceed $4 billion annually. Celebrity-hosted shows and true crime series dominate listener preferences. Major media companies acquire successful podcast networks to compete in the expanding audio entertainment market.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-podcast-growth-2024",
    "date_collected": "2024-11-18",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 123,
    "text": "Animation studios embrace diverse storytelling as international co-productions increase. Films from Asia, Africa, and Latin America gain prominence at major festivals and awards ceremonies. The shift reflects growing recognition of animation as a universal medium for cultural expression.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/animation-diversity-2024",
    "date_collected": "2024-03-05",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 124,
    "text": "Live music venues struggle with rising operational costs despite strong ticket demand. Smaller clubs face closure as rent, insurance, and equipment expenses increase. Musicians and fans rally to support grassroots venues crucial to developing emerging talent.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-venue-crisis-2025",
    "date_collected": "2024-12-24",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 125,
    "text": "Television networks invest in limited series format as viewers prefer complete stories over long-running shows. The trend reflects changing consumption habits and competition from streaming platforms. Producers appreciate creative freedom and defined endpoints for storytelling.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/media/limited-series-trend-2024",
    "date_collected": "2025-01-01",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 126,
    "text": "Comic book adaptations dominate box office with superhero films generating billions in global revenue. Studios announce ambitious multi-year plans for interconnected cinematic universes. However, some industry observers warn of audience fatigue with the genre's saturation.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-superhero-dominance-2024",
    "date_collected": "2024-04-29",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 127,
    "text": "Classical music institutions modernize programming to attract younger audiences. Orchestras incorporate contemporary compositions and collaborate with popular artists. The initiatives aim to ensure the art form's relevance and financial sustainability for future generations.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/classical-music-evolution",
    "date_collected": "2024-12-07",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 128,
    "text": "Reality television evolves with interactive formats allowing viewers to influence show outcomes through mobile apps. The technology creates new engagement opportunities and advertising revenue streams. Producers experiment with blending scripted and unscripted elements for hybrid entertainment experiences.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-interactive-tv-2025",
    "date_collected": "2024-05-20",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 129,
    "text": "Book publishing industry adapts to audiobook boom as listening surpasses print sales for some titles. Authors increasingly consider audio performance during writing process. Publishers invest in celebrity narrators and enhanced audio productions to compete in the growing market.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/audiobook-revolution-2024",
    "date_collected": "2024-08-06",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 130,
    "text": "Film preservation efforts intensify as digital formats prove less stable than expected. Archives work to save deteriorating films before content is lost forever. The challenge highlights importance of maintaining multiple format copies for long-term cultural heritage protection.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-film-preservation-2024",
    "date_collected": "2024-09-12",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 131,
    "text": "Theater companies experiment with immersive productions that blur lines between performers and audience. Site-specific performances in unconventional venues create unique experiences. The format attracts new theatergoers seeking interactive entertainment beyond traditional proscenium staging.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/immersive-theater-trend",
    "date_collected": "2024-08-02",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 132,
    "text": "Music festivals implement sustainability initiatives to reduce environmental impact. Organizers ban single-use plastics, use renewable energy, and offset carbon emissions. Festival-goers increasingly prioritize eco-friendly events when making attendance decisions.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-festival-sustainability-2025",
    "date_collected": "2024-03-25",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 133,
    "text": "Esports viewership rivals traditional sports as major tournaments fill stadiums and attract millions of online viewers. Professional gamers earn substantial incomes through prize money and sponsorships. Universities offer esports scholarships recognizing competitive gaming as legitimate athletic pursuit.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/technology/esports-mainstream-2024",
    "date_collected": "2024-08-08",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 134,
    "text": "Stand-up comedy experiences global expansion as streaming specials introduce comedians to international audiences. Performers tour worldwide, adapting material for different cultural contexts. The art form's accessibility and relatability drive its growing popularity across diverse demographics.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-comedy-global-2024",
    "date_collected": "2024-03-06",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 135,
    "text": "Dance companies incorporate technology into performances using projection mapping and motion sensors. The fusion of traditional choreography with digital elements creates visually stunning productions. Artistic directors balance innovation with preserving dance's essential human expression.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/dance-technology-fusion",
    "date_collected": "2025-01-06",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 136,
    "text": "Biographical films about musicians generate strong box office returns and award recognition. The genre's popularity reflects audience interest in artists' personal stories and cultural impact. Studios develop projects about legendary performers from various musical eras and genres.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-music-biopics-2025",
    "date_collected": "2024-07-21",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 137,
    "text": "Children's entertainment evolves to address contemporary social issues through age-appropriate storytelling. Animated series tackle topics like mental health, diversity, and environmental conservation. Parents and educators praise content that entertains while teaching important values.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/childrens-content-evolution",
    "date_collected": "2024-06-21",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 138,
    "text": "Horror genre experiences creative renaissance with films exploring psychological terror over graphic violence. Directors use horror framework to examine societal anxieties and cultural tensions. Critics celebrate the genre's artistic maturation and mainstream acceptance.",
    "labels": [
      "entertainment"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/entertainment-horror-renaissance-2024",
    "date_collected": "2024-08-29",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 139,
    "text": "Music education programs demonstrate positive impacts on student academic performance and social development. Schools expand arts funding despite budget pressures. Research shows participation in music activities correlates with improved cognitive skills and emotional well-being.",
    "labels": [
      "entertainment"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/lifestyle/entertainment/music-education-benefits",
    "date_collected": "2024-06-20",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 140,
    "text": "Alzheimer's finger-prick test could help diagnosis. An international trial is examining whether a finger-prick blood test could be used to help diagnose Alzheimer's disease. The study, involving 1,000 volunteers aged over 60 in the UK, US and Canada, will aim to detect biomarkers associated with the condition.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 141,
    "text": "Is fibre the new protein? The surprising health benefits of the latest wellness trend. Last year, many of us went protein-mad in the hopes of boosting our strength and fitness. But over the past few months, fibre - something very few of us get enough of every day - has become the hot topic on social media.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 142,
    "text": "Life-extending prostate cancer drug to be offered to thousands in England. A life-extending prostate cancer drug is to be made available to thousands of men in England in a matter of weeks, after a campaign by a patient and a charity. Abiraterone has been provided on the NHS in Scotland and Wales since 2023 but not in England and Northern Ireland, except in the most severe cases.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 143,
    "text": "Revolutionary eye injection saved my sight, says first-ever patient. Doctors say they have achieved the previously impossible - restoring sight and preventing blindness in people with a rare but dangerous eye conditon called hypotony. Moorfields hospital in London is the world's first dedicated clinic for the disorder and seven out of eight patients given the pioneering treatment have responded to the therapy, a pilot study shows.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 144,
    "text": "I spent months trying to find out if boosting my gut health could help me age better. Guts have become a source of immense fascination. Social media influencers promote unproven supplements said to boost gut health, whilst milk and kombucha brands promise to nourish them with 'good bacteria'.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 145,
    "text": "Finger-prick blood test could be early warning for children with type 1 diabetes. All UK children could be offered screening for type 1 diabetes using a simple finger-prick blood test, say researchers who have been running a large study. Currently, many young people go undiagnosed and risk developing a life-threatening complication called diabetic ketoacidosis that needs urgent hospital treatment.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 146,
    "text": "Why doing a mix of exercise could be the key to longer life? Don't put all your eggs in one basket when it comes to exercise - doing a variety of different physical activities every week is the key to boosting your health and living longer, a study suggests.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 147,
    "text": "Surgical robot helps record numbers of patients. A surgical robot has helped a team at Maidstone Hospital carry out a record number of gallbladder operations in a single day. The procedure, known as a cholecystectomy, is traditionally carried out with keyhole surgery which usually allows staff to complete five operations a day.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 148,
    "text": "Study suggests vaccine trials should include care homes. Research led by the University of Aberdeen into whether future vaccine trials should be conducted in care homes has suggested it is crucial for residents take part. It said those residents who were particularly vulnerable to infection due to their age and communal living were usually prioritised in vaccine roll-out programmes.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 149,
    "text": "New NHS diagnostic centre opens in Yeovil. A new NHS diagnostic centre, which will provide around 70,000 tests and outpatients appointments a year, has officially opened its doors. The facility next door to Yeovil District Hospital will include audiology services, an ear nose and throat unit, and cardiology.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 150,
    "text": "Relocation of dementia centre to be discussed. Plans to relocate a city's Dementia Resource Centre (DRC) to a new location were set to be discussed on Tuesday. Peterborough's cabinet members will be asked to approve relocating the facility from its current base in Lincoln Road, Millfield, to Paston Farm Community Centre.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 151,
    "text": "Screening plea in cervical cancer campaign. People in Wolverhampton are being urged to get screened and vaccinated in a bid to eliminate cervical cancer as part of an awareness event. Cervical Cancer Prevention Week started on Monday and the city council said it wanted to make sure women prioritised getting screened.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 152,
    "text": "Budget gap could hit £29m for mental health trust. The NHS trust that provides mental health services across Norfolk and Suffolk said it faced a multi-million pound budget gap. New figures predicted a £29m funding shortfall for the Norfolk and Suffolk NHS Foundation Trust in 2026-27.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 153,
    "text": "Scientists discover potential new cancer treatment. Scientists in Glasgow have discovered a potential treatment to stop growth in two of Scotland's deadliest cancers.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 154,
    "text": "Campaign challenges language around mental health. A community leader and author has launched a campaign to challenge the way people use language around mental health. Barry Ingleton, from Oxfordshire, lives with bipolar disorder and said he believes the line between everyday emotion and clinical illness has become increasingly blurred.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 155,
    "text": "Care facilities increased to free up hospital beds. Services to help patients leave hospital are to be 'stepped up' to free up hospital beds in Hull, health officials have said. The NHS Humber Health Partnership said it was working to enhance community care facilities for patients from Hull Royal Infirmary and Castle Hill Hospital.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 156,
    "text": "A mental health hospital's 200 years of care. A hospital which cares for people living with a mental illness is celebrating its 200th anniversary. Oxford's Warneford Hospital is holding a year-long programme of events to mark the milestone, which it hopes will not only to inform people about the site but also get people talking about mental health.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 157,
    "text": "Health board admits fatal infections probably caused by water system.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 158,
    "text": "Charity's concern over contaminated blood payouts.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 159,
    "text": "Moving just 5 more minutes each day could boost longevity",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 160,
    "text": "Beige fat may help regulate blood pressure, mice study finds.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 161,
    "text": "High cholesterol may predict future heart disease risk, even in healthy women",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 162,
    "text": "Exercise may reduce depression symptoms as effectively as therapy",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 163,
    "text": "Restoring missing lipid may help ease dementia damage in brain, study finds.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 164,
    "text": "Food preservatives linked to type 2 diabetes and cancer, studies warn.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 165,
    "text": "Fasting-mimicking diet may help with Crohn's disease",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 166,
    "text": "Physical exercise may help prevent nerve damage during chemotherapy, study finds",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 167,
    "text": "Meeting accepted physical activity guidelines may offset the increased likelihood of early death that affects people with type 2 diabetes who spend too much time sitting, says a new study. For people with diabetes who sit too much and do not get enough exercise, there is a 73% increased risk of early all-cause mortality.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 168,
    "text": "Increasing cardiorespiratory endurance improves oxygen uptake in the lungs and heart and can help a person sustain physical activity for longer. Other names for cardiorespiratory endurance include cardiovascular fitness, cardiovascular endurance, and cardiorespiratory fitness.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 169,
    "text": "Muscles and nerve fibers allow a person to move their body and enable the internal organs to function. There are more than 600 muscles in the human body. People also have different types of muscle. A kind of elastic tissue makes up each muscle, which consists of thousands, or tens of thousands, of small muscle fibers. Each fiber comprises many tiny strands called fibrils.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 170,
    "text": "People who are 19–64 years of age should aim to get 150 minutes of moderate aerobic activity each week. Younger children should be physically active as well. It is important to incorporate strength training exercises into any routine to keep the muscles strong and flexible. As a person's health permits, they should continue this for as long as possible throughout life. A person may choose swimming over another form of exercise for a range of reasons. It gives the body a thorough workout and has many advantages for people of all ages and fitness levels.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 171,
    "text": "The powerful combination of cardiovascular exercise and strength training can help a person build muscle strength and improve their heart, lung, and circulatory health. Exercises that target multiple muscle groups are particularly effective. These include various exercises that require little to no equipment and can suit a range of fitness levels.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 172,
    "text": "From age 30, a person's muscle mass decreases by 3-8% per decade, and this decline accelerates after age 60. Although muscle loss cannot be prevented entirely, we know that an active lifestyle, including strength training, can slow the decline and increase muscle strength, helping people remain mobile and independent for as long as possible.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 173,
    "text": "People of all ages can experience knee pain. Athletes may experience a type of knee pain called patellofemoral pain syndrome or runner’s knee. In addition to being common in active people, knee pain can also be a problem for people with arthritis.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 174,
    "text": "While it may be tempting to avoid exercise when knee pain occurs, this is not always the appropriate solution. Certain types of exercise can help alleviate existing knee pain and prevent future pain or injury by providing the knee with extra support.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 175,
    "text": "The NHS has pushed back the launch date of an £88m overhaul to its IT systems by a year because of delays.The electronic patient record (EPR) for Norfolk's three acute hospitals will not go live in March as originally planned.The programme had been described by local trust bosses as the most transformative work undertaken at the sites in the past 20 years and as a .",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 176,
    "text": "A care service providing help to people in their homes has been judged as requiring improvement after concerns were raised. Inspectors who visited House of the Flame Lily, in Penn Road, Wolverhampton, found the service was in breach of five legal regulations, a report published on Wednesday said.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 177,
    "text": "A university building in Inverness which was shut following the identification of legionella in the water systems has been closed again until the new year. The health studies centre UHI House recently reopened after a week of cleaning and disinfection.Last month, the university said the precautionary closure followed the detection of the potentially harmful bacteria.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 178,
    "text": "Ruth Alexander gathers the most useful, actionable nutrition advice from our episodes of 2025 to help set you up for 2026. Things like how to nourish your brain, keep an eye on portion sizes, and why it’s important to focus on fibre. Experts from around the world tell us about the small tweaks that can make a real difference to how we eat, think, and feel.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 179,
    "text": "Ultra-processed food - things like biscuits and crisps - are making up more and more of our diets globally. In the US and the UK, ultra-processed food actually make up half the calories we eat. New research is calling for more action to reduce this intake because of its potential threat to our health. But what is ultra-processed food and how does it impact the body?",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 180,
    "text": "Wellbeing has become such a priceless (or in many cases pricey) endeavour that we can't seem to get enough of it.Last year, we were mainlining magnesium, consuming creatine - a muscle boosting supplement that became mainstream, and we turned to AI chatbots for help with anything from a personalised training regime to a daily meal plan.",
    "labels": [
      "health"
    ],
    "source": "Unknown",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": ""
  },
  {
    "id": 181,
    "text": "Breakthrough Alzheimer's treatment shows promising results in phase three clinical trials, slowing cognitive decline by 35% in patients. The drug targets amyloid plaques in the brain and represents the most significant advancement in Alzheimer's therapy in decades. Researchers hope regulatory approval will come within the next year, offering new hope to millions of patients worldwide.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-alzheimers-breakthrough-2025",
    "date_collected": "2024-10-29",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 182,
    "text": "Global health organizations warn of rising antibiotic resistance threatening modern medicine's foundation. Common infections become increasingly difficult to treat as bacteria evolve resistance to existing drugs. Experts call for urgent action including new antibiotic development, improved prescribing practices, and enhanced infection prevention measures.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/antibiotic-resistance-crisis",
    "date_collected": "2024-09-26",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 183,
    "text": "Mental health services expand globally as governments recognize psychological well-being as essential healthcare priority. New programs provide accessible counseling and therapy services through digital platforms and community centers. The initiatives aim to address the mental health crisis exacerbated by pandemic isolation and economic stress.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-mental-health-expansion-2024",
    "date_collected": "2024-06-02",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 184,
    "text": "Revolutionary gene therapy cures rare blood disorder in landmark medical achievement. Patients with sickle cell disease show complete remission after single treatment using CRISPR gene editing technology. The success opens possibilities for treating thousands of genetic conditions previously considered incurable.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/gene-therapy-cure-2024",
    "date_collected": "2024-08-20",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 185,
    "text": "Obesity rates continue climbing worldwide despite increased awareness of health risks and prevention efforts. Studies identify complex factors including food environment, socioeconomic status, and genetic predisposition. Public health officials advocate for comprehensive approaches addressing individual behavior and systemic issues.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-obesity-trends-2025",
    "date_collected": "2024-06-02",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 186,
    "text": "Artificial intelligence diagnostic tools demonstrate accuracy matching or exceeding human physicians in detecting diseases. AI systems analyze medical images, identify cancer, and predict patient outcomes with remarkable precision. Healthcare providers integrate these technologies while maintaining human oversight for clinical decision-making.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/technology/ai-medical-diagnosis-2024",
    "date_collected": "2024-03-29",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 187,
    "text": "Telemedicine adoption remains high post-pandemic as patients and providers appreciate convenience and accessibility. Virtual consultations reduce healthcare costs and improve access for rural communities. Regulatory frameworks evolve to support remote care while ensuring quality and safety standards.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-telemedicine-growth-2024",
    "date_collected": "2024-07-26",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 188,
    "text": "Vaccine development advances rapidly using mRNA technology proven successful during COVID-19 pandemic. Researchers create experimental vaccines for cancer, HIV, and malaria showing encouraging early results. The platform's flexibility allows quick adaptation to emerging infectious disease threats.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/mrna-vaccine-expansion",
    "date_collected": "2024-08-15",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 189,
    "text": "Sleep deprivation epidemic affects billions globally with serious health consequences including increased disease risk. Studies link insufficient sleep to cardiovascular problems, diabetes, and mental health disorders. Experts recommend prioritizing sleep hygiene and addressing societal factors that discourage adequate rest.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-sleep-crisis-2025",
    "date_collected": "2024-04-19",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 190,
    "text": "Personalized medicine approaches transform cancer treatment with therapies tailored to individual tumor genetics. Precision oncology improves survival rates and reduces side effects compared to traditional chemotherapy. The field's growth depends on genomic sequencing becoming more affordable and accessible.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/personalized-cancer-treatment",
    "date_collected": "2024-01-03",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 191,
    "text": "Maternal mortality rates decline in developing countries through improved prenatal care and skilled birth attendance. International health initiatives provide training, equipment, and infrastructure to support safe deliveries. Progress continues but significant disparities persist between and within nations.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-maternal-health-progress-2024",
    "date_collected": "2024-12-26",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 192,
    "text": "Microbiome research reveals gut bacteria's crucial role in overall health affecting immunity, metabolism, and mental state. Scientists develop probiotic therapies targeting specific conditions from inflammatory bowel disease to depression. The emerging field promises new treatment approaches for numerous health challenges.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/microbiome-discoveries-2024",
    "date_collected": "2024-06-23",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 193,
    "text": "Childhood vaccination rates drop in some regions raising concerns about preventable disease outbreaks. Misinformation and vaccine hesitancy contribute to declining immunization coverage. Public health campaigns work to rebuild trust and emphasize vaccines' safety and effectiveness.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-vaccination-rates-2025",
    "date_collected": "2024-11-11",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 194,
    "text": "Wearable health devices become increasingly sophisticated monitoring vital signs and detecting potential medical issues. Smartwatches identify irregular heart rhythms, track blood oxygen levels, and alert users to concerning patterns. Integration with healthcare systems enables proactive medical intervention.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/technology/wearable-health-tech-2024",
    "date_collected": "2024-11-21",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 195,
    "text": "Loneliness epidemic affects mental and physical health with impacts comparable to smoking and obesity. Social isolation increases risks for cardiovascular disease, dementia, and premature death. Communities develop programs fostering social connections especially among elderly and vulnerable populations.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-loneliness-crisis-2024",
    "date_collected": "2024-10-06",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 196,
    "text": "Organ transplant waiting lists shrink as donation rates increase and preservation techniques improve. New technologies extend organ viability allowing transportation over longer distances. Researchers also make progress toward lab-grown organs that could eventually eliminate transplant shortages.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/organ-transplant-advances",
    "date_collected": "2024-05-06",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 197,
    "text": "Diabetes prevalence rises globally driven by obesity, sedentary lifestyles, and aging populations. Healthcare systems struggle with treatment costs and complications including kidney disease and vision loss. Prevention programs emphasize lifestyle modifications and early screening for at-risk individuals.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-diabetes-epidemic-2025",
    "date_collected": "2024-08-03",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 198,
    "text": "Robotic surgery systems enable minimally invasive procedures with enhanced precision and faster patient recovery. Surgeons operate complex cases using advanced robotic platforms providing magnified 3D visualization. The technology expands to more surgical specialties though high costs limit widespread adoption.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/robotic-surgery-expansion",
    "date_collected": "2024-09-19",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 199,
    "text": "Air pollution causes millions of premature deaths annually with children and elderly most vulnerable. Studies link poor air quality to respiratory disease, heart problems, and cognitive decline. Cities implement emission reduction strategies including vehicle restrictions and green space expansion.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-air-pollution-impact-2024",
    "date_collected": "2024-01-06",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 200,
    "text": "Regenerative medicine advances with stem cell therapies showing promise for treating degenerative diseases. Clinical trials test treatments for conditions from spinal cord injuries to macular degeneration. Ethical frameworks guide research while balancing innovation with safety and moral considerations.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/stem-cell-progress-2024",
    "date_collected": "2024-11-08",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 201,
    "text": "Antibiotic stewardship programs reduce unnecessary prescriptions helping preserve drug effectiveness. Hospitals and clinics implement guidelines ensuring antibiotics are used only when medically necessary. The initiatives represent critical strategy in combating antimicrobial resistance threat.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-antibiotic-stewardship-2025",
    "date_collected": "2024-05-10",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 202,
    "text": "Chronic pain affects billions worldwide with limited effective treatment options causing significant suffering. Researchers investigate non-opioid pain management approaches including nerve stimulation and targeted therapies. The work aims to provide relief while avoiding addiction risks associated with traditional painkillers.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/chronic-pain-research",
    "date_collected": "2024-07-07",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 203,
    "text": "Nutritional science evolves beyond calorie counting to understand food's complex effects on health. Research examines how diet influences inflammation, gut microbiome, and disease risk. Personalized nutrition recommendations based on individual genetics and metabolism show promise.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-nutrition-science-2024",
    "date_collected": "2024-06-03",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 204,
    "text": "Healthcare workforce shortages worsen globally as demand outpaces supply of doctors, nurses, and allied health professionals. Burnout and poor working conditions drive professionals from the field. Governments invest in training programs and improve compensation to address critical staffing gaps.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/workforce-shortage-crisis",
    "date_collected": "2024-08-07",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 205,
    "text": "Immunotherapy revolutionizes cancer treatment by harnessing the body's immune system to fight tumors. Checkpoint inhibitors and CAR-T cell therapies achieve remarkable results for previously untreatable cancers. Ongoing research works to expand these approaches to more cancer types.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-immunotherapy-advances-2025",
    "date_collected": "2024-05-03",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 206,
    "text": "Rare disease patients benefit from increased research attention and orphan drug development. Patient advocacy groups drive awareness and funding for conditions affecting small populations. Regulatory incentives encourage pharmaceutical companies to develop treatments for rare disorders.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/business/healthcare/rare-disease-progress",
    "date_collected": "2024-08-05",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 207,
    "text": "Exercise medicine gains recognition as powerful intervention for preventing and treating chronic diseases. Studies demonstrate physical activity's benefits rival or exceed many pharmaceutical treatments. Healthcare providers increasingly prescribe exercise alongside traditional medical therapies.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-exercise-medicine-2024",
    "date_collected": "2024-08-06",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 208,
    "text": "Infectious disease surveillance systems improve using artificial intelligence to detect outbreaks earlier. Digital tools analyze data from multiple sources identifying concerning patterns before widespread transmission. Enhanced monitoring capabilities strengthen global pandemic preparedness and response.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/technology/disease-surveillance-ai",
    "date_collected": "2024-01-24",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 209,
    "text": "Addiction treatment approaches evolve incorporating medication-assisted therapy and harm reduction strategies. Evidence-based programs demonstrate better outcomes than abstinence-only models. Stigma reduction efforts encourage people struggling with addiction to seek help without fear of judgment.",
    "labels": [
      "health"
    ],
    "source": "BBC News",
    "url": "https://www.bbc.com/news/health-addiction-treatment-2025",
    "date_collected": "2024-11-22",
    "copyright": "© 2025 BBC. The BBC is not responsible for the content of external sites."
  },
  {
    "id": 210,
    "text": "Brain-computer interfaces enable paralyzed patients to communicate and control devices using thoughts alone. Experimental systems decode neural signals allowing users to type messages and operate robotic limbs. The technology offers hope for restoring independence to people with severe disabilities.",
    "labels": [
      "health"
    ],
    "source": "Reuters",
    "url": "https://www.reuters.com/technology/brain-computer-interface-2024",
    "date_collected": "2024-11-02",
    "copyright": "© 2025 Reuters. All rights reserved."
  },
  {
    "id": 211,
    "text": "Pharmaceutical giant Pfizer reports record quarterly profits as new weight-loss drug gains FDA approval, sending stock prices soaring 15% in morning trading.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Combines corporate financial performance with medical/health product approval"
  },
  {
    "id": 212,
    "text": "Healthcare insurance companies face massive losses as new regulations require coverage of mental health services, forcing industry-wide restructuring and layoffs.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Insurance business impact from healthcare policy changes"
  },
  {
    "id": 213,
    "text": "Telemedicine startup raises $500 million in Series C funding to expand virtual doctor consultations across rural America, addressing healthcare accessibility gaps.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Business investment in healthcare technology"
  },
  {
    "id": 214,
    "text": "Major hospital chains report bankruptcy filings as rising operational costs and nurse shortages create unsustainable financial pressures across the healthcare sector.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Healthcare industry financial crisis"
  },
  {
    "id": 215,
    "text": "Biotech company stock crashes 40% after clinical trial failure for experimental Alzheimer's treatment, wiping out $3 billion in market value overnight.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Medical research failure impacting business/markets"
  },
  {
    "id": 216,
    "text": "Amazon announces acquisition of primary care provider One Medical for $3.9 billion, expanding tech giant's footprint in healthcare delivery services.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Corporate merger in healthcare sector"
  },
  {
    "id": 217,
    "text": "Medical device manufacturer recalls defective pacemakers affecting 50,000 patients, facing potential billion-dollar lawsuits and regulatory sanctions from FDA.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Product safety issue with business and health implications"
  },
  {
    "id": 218,
    "text": "Private equity firms invest heavily in dental clinic chains, raising concerns about profit-driven care compromising patient treatment quality and accessibility.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Business investment affecting healthcare delivery"
  },
  {
    "id": 219,
    "text": "Gym membership sales surge 35% as employers offer wellness program subsidies to reduce healthcare costs and improve worker productivity.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Fitness industry growth tied to corporate health initiatives"
  },
  {
    "id": 220,
    "text": "Generic drug manufacturers face antitrust investigation for price-fixing schemes that inflated medication costs by 1000%, affecting millions of patients nationwide.",
    "labels": [
      "business",
      "health"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Business practices impacting healthcare affordability"
  },
  {
    "id": 221,
    "text": "Disney reports streaming subscriber losses for third consecutive quarter, prompting 7,000 layoffs across film studios and theme park divisions.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment company financial performance and corporate restructuring"
  },
  {
    "id": 222,
    "text": "Taylor Swift's Eras Tour generates $2 billion in ticket revenue, becoming highest-grossing concert series in history and boosting local economies across 50 cities.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment event with major economic impact"
  },
  {
    "id": 223,
    "text": "Hollywood writers and actors strike for 148 days over streaming residuals and AI concerns, costing entertainment industry estimated $5 billion in lost production.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Labor dispute affecting entertainment business"
  },
  {
    "id": 224,
    "text": "Netflix stock plummets 35% after announcing password-sharing crackdown backfires, losing 2 million subscribers and $15 billion in market capitalization.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Streaming business strategy impacting financial performance"
  },
  {
    "id": 225,
    "text": "Warner Bros. Discovery writes down $9 billion in assets, cancels completed films for tax breaks, sparking outrage among filmmakers and industry professionals.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Corporate financial decisions affecting entertainment content"
  },
  {
    "id": 226,
    "text": "Video game industry layoffs exceed 10,000 workers as major publishers prioritize live-service games over single-player experiences, reshaping development landscape.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Gaming industry business strategy and workforce impact"
  },
  {
    "id": 227,
    "text": "Broadway theaters report record-breaking $1.8 billion season revenue as post-pandemic audiences return, with Hamilton alone grossing $3 million weekly.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Theater industry financial recovery"
  },
  {
    "id": 228,
    "text": "Spotify raises subscription prices 20% while reducing artist royalty payments, drawing criticism from musicians and antitrust scrutiny from regulators.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Music streaming business model affecting artists"
  },
  {
    "id": 229,
    "text": "AMC Theatres files Chapter 11 bankruptcy as streaming services and declining attendance force closure of 200 locations nationwide.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Movie theater business crisis"
  },
  {
    "id": 230,
    "text": "Sony acquires Crunchyroll for $1.2 billion, consolidating anime streaming market and raising concerns about monopolistic control over Japanese animation distribution.",
    "labels": [
      "business",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Corporate acquisition in entertainment sector"
  },
  {
    "id": 231,
    "text": "Professional athletes speak out about mental health struggles, with Olympic gymnast Simone Biles withdrawing from competition to prioritize psychological well-being.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Sports/entertainment figure addressing mental health"
  },
  {
    "id": 232,
    "text": "Documentary exploring America's opioid crisis wins Oscar, featuring interviews with addiction survivors and families devastated by pharmaceutical company negligence.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment content focused on health crisis"
  },
  {
    "id": 233,
    "text": "Celebrity chef Jamie Oliver launches campaign against childhood obesity, producing cooking shows teaching families healthy meal preparation on limited budgets.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment personality promoting health initiatives"
  },
  {
    "id": 234,
    "text": "Netflix series '13 Reasons Why' linked to increased teen suicide rates by researchers, prompting mental health warnings and content modifications.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment content affecting mental health outcomes"
  },
  {
    "id": 235,
    "text": "Professional esports players suffer repetitive strain injuries and burnout, leading to mandatory health breaks and ergonomic requirements in competitive gaming.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Gaming entertainment causing health issues"
  },
  {
    "id": 236,
    "text": "Broadway star reveals cancer diagnosis during performance, using platform to advocate for early screening and healthcare access for performing artists.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment figure sharing health journey"
  },
  {
    "id": 237,
    "text": "Music festival implements harm reduction strategies including drug testing and medical tents after overdose deaths, balancing entertainment with public health.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment event addressing health safety"
  },
  {
    "id": 238,
    "text": "Reality TV show 'The Biggest Loser' faces criticism from medical experts for promoting unhealthy rapid weight loss and contributing to eating disorders.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment program with health implications"
  },
  {
    "id": 239,
    "text": "Professional dancers develop chronic pain and eating disorders due to industry pressures, prompting calls for better healthcare support in performing arts.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment industry health crisis"
  },
  {
    "id": 240,
    "text": "Meditation and wellness apps featuring celebrity voices generate $4 billion annually, as stars like LeBron James promote mental health through guided relaxation.",
    "labels": [
      "health",
      "entertainment"
    ],
    "source": "Multi-label Training Example",
    "url": "",
    "date_collected": "2026-01-30",
    "copyright": "",
    "explanation": "Entertainment figures in wellness/health products"
  }
]